In [3]:
import pandas as pd
import numpy as np
import sys
import os

In [138]:

# os.chdir("./SalesAnalysis/Sales_Data/")
salesData = pd.concat([pd.read_csv(x) for x in os.listdir("./")])

In [139]:
salesData = salesData.dropna(how='any')

In [140]:
salesData['Date'] = salesData["Order Date"].str.split(' ',expand=True)[0]
salesData['Time'] = salesData["Order Date"].str.split(' ',expand=True)[1]
salesData = salesData.drop(columns=["Order Date"])
salesData.head()

,Order ID,Product,Quantity Ordered,Price Each,Purchase Address,Date,Time
0,248151,AA Batteries (4-pack),4,3.84,"380 North St, Los Angeles, CA 90001",09/17/19,14:44
1,248152,USB-C Charging Cable,2,11.95,"511 8th St, Austin, TX 73301",09/29/19,10:19
2,248153,USB-C Charging Cable,1,11.95,"151 Johnson St, Los Angeles, CA 90001",09/16/19,17:48
3,248154,27in FHD Monitor,1,149.99,"355 Hickory St, Seattle, WA 98101",09/27/19,07:52
4,248155,USB-C Charging Cable,1,11.95,"125 5th St, Atlanta, GA 30301",09/01/19,19:03

In [144]:
salesData = salesData[salesData["Date"].str[:2].isin(['0' + str(i) if i < 10 else ''+ str(i)  for i in range(1,32)])]

In [225]:
salesData["Date"] = pd.to_datetime(salesData["Date"])
salesData["Month"] = pd.to_numeric(salesData["Date"].dt.month)
salesData = salesData.astype({"Order ID": int,
                              "Product": str,
                              "Quantity Ordered": int,
                              "Price Each": float,
                              "Purchase Address":str,})

In [226]:
salesData.dtypes

Order ID                     int64
Product                     object
Quantity Ordered             int64
Price Each                 float64
Purchase Address            object
Date                datetime64[ns]
Time                        object
sales                      float64
Month                        int32
dtype: object

In [227]:
salesData["sales"] = salesData["Quantity Ordered"] * salesData["Price Each"]

In [228]:
salesData.head()

,Order ID,Product,Quantity Ordered,Price Each,Purchase Address,Date,Time,sales,Month
0,248151,AA Batteries (4-pack),4,3.84,"380 North St, Los Angeles, CA 90001",2019-09-17,14:44,15.36,9
1,248152,USB-C Charging Cable,2,11.95,"511 8th St, Austin, TX 73301",2019-09-29,10:19,23.90,9
2,248153,USB-C Charging Cable,1,11.95,"151 Johnson St, Los Angeles, CA 90001",2019-09-16,17:48,11.95,9
3,248154,27in FHD Monitor,1,149.99,"355 Hickory St, Seattle, WA 98101",2019-09-27,07:52,149.99,9
4,248155,USB-C Charging Cable,1,11.95,"125 5th St, Atlanta, GA 30301",2019-09-01,19:03,11.95,9

In [238]:
salesData.groupby("Month").sum(numeric_only=True)[['sales']]

            sales
Month
1      1822256.73
2      2202022.42
3      2807100.38
4      3390670.24
5      3152606.75
6      2577802.26
7      2647775.76
8      2244467.88
9      2097560.13
10     3736726.88
11     3199603.20
12     4613443.34